aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam3/atsam3sd8/include/atsam3sd8b.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2013, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM3SD8B_
#define _SAM3SD8B_

/** \addtogroup SAM3SD8B_definitions SAM3SD8B definitions
  This file defines all structures and symbols for SAM3SD8B:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAM3SD8B */
/* ************************************************************************** */
/** \addtogroup SAM3SD8B_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M3 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M3 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M3 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M3 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M3 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M3 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M3 System Tick Interrupt       */
/******  SAM3SD8B specific Interrupt Numbers *********************************/

  SUPC_IRQn            =  0, /**<  0 SAM3SD8B Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAM3SD8B Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAM3SD8B Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAM3SD8B Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAM3SD8B Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAM3SD8B Power Management Controller (PMC) */
  EFC_IRQn             =  6, /**<  6 SAM3SD8B Enhanced Embedded Flash Controller (EFC) */
  UART0_IRQn           =  8, /**<  8 SAM3SD8B UART 0 (UART0) */
  UART1_IRQn           =  9, /**<  9 SAM3SD8B UART 1 (UART1) */
  PIOA_IRQn            = 11, /**< 11 SAM3SD8B Parallel I/O Controller A (PIOA) */
  PIOB_IRQn            = 12, /**< 12 SAM3SD8B Parallel I/O Controller B (PIOB) */
  USART0_IRQn          = 14, /**< 14 SAM3SD8B USART 0 (USART0) */
  USART1_IRQn          = 15, /**< 15 SAM3SD8B USART 1 (USART1) */
  HSMCI_IRQn           = 18, /**< 18 SAM3SD8B Multimedia Card Interface (HSMCI) */
  TWI0_IRQn            = 19, /**< 19 SAM3SD8B Two Wire Interface 0 (TWI0) */
  TWI1_IRQn            = 20, /**< 20 SAM3SD8B Two Wire Interface 1 (TWI1) */
  SPI_IRQn             = 21, /**< 21 SAM3SD8B Serial Peripheral Interface (SPI) */
  SSC_IRQn             = 22, /**< 22 SAM3SD8B Synchronous Serial Controler (SSC) */
  TC0_IRQn             = 23, /**< 23 SAM3SD8B Timer/Counter 0 (TC0) */
  TC1_IRQn             = 24, /**< 24 SAM3SD8B Timer/Counter 1 (TC1) */
  TC2_IRQn             = 25, /**< 25 SAM3SD8B Timer/Counter 2 (TC2) */
  TC3_IRQn             = 26, /**< 26 SAM3SD8B Timer/Counter 3 (TC3) */
  TC4_IRQn             = 27, /**< 27 SAM3SD8B Timer/Counter 4 (TC4) */
  TC5_IRQn             = 28, /**< 28 SAM3SD8B Timer/Counter 5 (TC5) */
  ADC_IRQn             = 29, /**< 29 SAM3SD8B Analog To Digital Converter (ADC) */
  DACC_IRQn            = 30, /**< 30 SAM3SD8B Digital To Analog Converter (DACC) */
  PWM_IRQn             = 31, /**< 31 SAM3SD8B Pulse Width Modulation (PWM) */
  CRCCU_IRQn           = 32, /**< 32 SAM3SD8B CRC Calculation Unit (CRCCU) */
  ACC_IRQn             = 33, /**< 33 SAM3SD8B Analog Comparator (ACC) */
  UDP_IRQn             = 34, /**< 34 SAM3SD8B USB Device Port (UDP) */

  PERIPH_COUNT_IRQn    = 35  /**< Number of peripheral IDs */
} IRQn_Type;

